IDEA Open Model
LineSupportSegment.SupportTypeX Property
Compatible with IDEA StatiCa 20.1
 Support type in dirrection X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public SupportTypeInDirrection SupportTypeX { get; set; }
Public Property SupportTypeX As SupportTypeInDirrection
	Get
	Set
Property Value
Type: SupportTypeInDirrection
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace